#pragma once
#include "Hero_and_Monster.h"

Monster monsters[3][6] = {
    {   // 简单小怪
        Monster("瘴气爬行者", 100, 3, 6, 2, 90, 3),
        Monster("邪焰鼠", 90, 4, 5, 3, 95, 4),
        Monster("碎骨猎犬", 110, 4, 6, 1, 100, 5),
        Monster("深林幽鬼", 120, 3, 7, 4, 110, 6),
        Monster("夜眼蝠", 130, 4, 5, 5, 115, 8),
        Monster("裂晶虫", 140, 3, 5, 3, 120, 10)
    },
    {   // 中等小怪
        Monster("腐蚀巡游者", 150, 5, 8, 4, 160, 10),
        Monster("漆黑腐鸦", 160, 6, 9, 2, 170, 12),
        Monster("幽铁巨像", 170, 5, 8, 6, 180, 15),
        Monster("白骨长眠者", 180, 7, 8, 2, 190, 18),
        Monster("雾中的低语者", 165, 6, 9, 3, 200, 20),
        Monster("残响灵偶", 155, 7, 8, 4, 195, 25)
    },
    {   // 困难小怪
        Monster("冷雾腐尸", 200, 9, 12, 6, 210, 25),
        Monster("泥沼吞噬者", 215, 11, 10, 7, 230, 30),
        Monster("眠语梦魔", 220, 10, 11, 10, 240, 50),
        Monster("翡翠毒蜂", 230, 9, 10, 12, 250, 75),
        Monster("断轮守卫", 240, 11, 11, 9, 275, 100),
        Monster("石牙龟", 250, 10, 12, 5, 300, 125)
    }
};
