#pragma once
#include "Hero_and_Monster.h"

Monster monsters[3][6] = {
    {
        Monster("瘴气爬行者", 30, 5, 3, 2, 5, 3),
        Monster("邪焰鼠", 35, 6, 4, 3, 6, 4),
        Monster("碎骨猎犬", 40, 7, 3, 4, 8, 5),
        Monster("深林幽鬼", 45, 8, 5, 5, 10, 6),
        Monster("夜眼蝠", 50, 9, 7, 6, 12, 8),
        Monster("裂晶虫", 55, 10, 4, 8, 14, 10)
    },
    {
        Monster("腐蚀巡游者", 70, 12, 6, 5, 15, 10),
        Monster("漆黑腐鸦", 80, 14, 8, 6, 18, 12),
        Monster("幽铁巨像", 90, 16, 5, 8, 20, 15),
        Monster("白骨长眠者", 100, 18, 9, 10, 22, 18),
        Monster("雾中的低语者", 120, 20, 12, 12, 25, 20),
        Monster("残响灵偶", 140, 22, 10, 14, 30, 25)
    },
    {
        Monster("冷雾腐尸", 150, 25, 10, 12, 35, 25),
        Monster("泥沼吞噬者", 180, 28, 12, 14, 40, 30),
        Monster("眠语梦魔", 250, 35, 15, 20, 60, 50),
        Monster("翡翠毒蜂", 300, 40, 18, 25, 75, 75),
        Monster("断轮守卫", 400, 50, 20, 30, 100, 100),
        Monster("石牙龟", 500, 60, 25, 35, 125, 125)
    }
    // {
    //     Monster("梦魇蝶后 · 赛莲", 200, 30, 15, 20, 60, 50),
    //     Monster("焚天古龙 · 阿祖尔瓦恩", 300, 35, 18, 25, 75, 75),
    //     Monster("深渊邪龙 · 奈克托斯", 300, 40, 20, 30, 100, 100),
    //     Monster("大曾头", 400, 50, 25, 35, 125, 125),
    //     Monster("大李头", 500, 60, 30, 40, 150, 150),
    //     Monster("勇者", 600, 70, 35, 45, 175, 175)
    // }

};